Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The official IDE of Renesas is called e\ |sup2| studio.
it_it: L'IDE ufficiale di Renesas si chiama e\ |sup2| studio.

source: The offline converter can convert an image into the above formats plus all the other supported color formats.
it_it: Il convertitore offline può convertire un'immagine nei formati sopra indicati e in tutti gli altri formati di colore supportati.

source: The offline converter is contained in ``./scripts/LVGLImage.py``.
it_it: Il convertitore offline è contenuto in ``./scripts/LVGLImage.py``.

source: The one implemented here is optimal for reading large files in chunks, which is what the image decoder does.
it_it: Quello implementato qui è ottimale per la lettura di file di grandi dimensioni in blocchi, che è ciò che fa il decoder di immagini.

source: The ones it cannot perform will be done in parallel by the software draw unit.
it_it: Quelli che non può eseguire verranno eseguiti in parallelo dall'unità di disegno software.

source: The only common point is that both Widgets and Components support having ``<prop>`` (properties) in the ``<api>`` tag to describe their interface.
it_it: L'unico punto in comune è che sia i Widget che i Componenti supportano ``<prop>`` (proprietà) nel tag ``<api>`` per descrivere la loro interfaccia.

source: The only difference between the :cpp:func:`my_lcd_send_cmd` and :cpp:func:`my_lcd_send_color` functions is that :cpp:func:`my_lcd_send_cmd` is used to send short commands and it is expected to complete the transaction when it returns (in other words, it should be blocking), while :cpp:func:`my_lcd_send_color` is only used to send pixel data, and it is recommended to use DMA to transmit data in the background.
it_it: L'unica differenza tra le funzioni :cpp:func:`my_lcd_send_cmd` e :cpp:func:`my_lcd_send_color` è che :cpp:func:`my_lcd_send_cmd` viene utilizzata per inviare comandi brevi e ci si aspetta che completi la transazione quando ritorna (in altre parole, dovrebbe essere bloccante), mentre :cpp:func:`my_lcd_send_color` viene utilizzata solo per inviare dati di pixel e si consiglia di utilizzare DMA per trasmettere i dati in background.

source: The only difference is that in the bind function both the Spangroup and the Span need to be specified:
it_it: L'unica differenza è che nella funzione di binding devono essere specificati sia lo Spangroup che lo Span:

source: The only difference is that instead of one source image, you set an array of multiple source images that supply "frames" in an animation.
it_it: L'unica differenza è che invece di un'immagine sorgente, si imposta un array di più immagini sorgente che forniscono i "fotogrammi" in un'animazione.

source: The only difference is that it displays user-defined images for each state instead of drawing a rectangle.
it_it: L'unica differenza è che visualizza immagini definite dall'utente per ogni stato invece di disegnare un rettangolo.

source: The only drawback is that the incorrect line number relative to the un-minified version will be logged if there is a parse failure.
it_it: L'unico inconveniente è che in caso di errore di analisi verrà registrato il numero di riga errato relativo alla versione non minimizzata.

source: The only possible property of the ``<screen>`` tag is ``permanent``, which can be ``true`` or ``false`` (default).
it_it: L'unica proprietà possibile del tag ``<screen>`` è ``permanent``, che può essere ``true`` o ``false`` (il default).

source: The only supported font format is 4 bpp.
it_it: L'unico formato di font supportato è 4 bpp.

source: The only thing that cannot be learned from the XML files is the data stored in the application's flash.
it_it: L'unica cosa che non può essere appresa dai file XML sono i dati memorizzati nella flash dell'applicazione.

source: The only way to start it again is to call :cpp:expr:`lv_anim_timeline_start(timeline)`, which starts the Timeline from the beginning or at the point set by :cpp:expr:`lv_anim_timeline_set_progress(timeline, progress)`.
it_it: L'unico modo per riavviarla è chiamare :cpp:expr:`lv_anim_timeline_start(timeline)`, che avvia la Timeline dall'inizio o dal punto impostato da :cpp:expr:`lv_anim_timeline_set_progress(timeline, progress)`.

source: The opacity may also be changed.
it_it: Anche l'opacità può essere modificata.

source: The operating system is based on a micro-kernel design, with the file system(s), network stack, and various other drivers each running in its own process with a separate address space.
it_it: Il sistema operativo si basa su un design a microkernel, con file system, stack di rete e vari altri driver, ognuno dei quali eseguito in un proprio processo con uno spazio di indirizzamento separato.

source: The order of bits is MSB first, which means:
it_it: L'ordine dei bit è MSB prima, ovvero:

source: The order of this list (and thus the order in which :ref:`Draw Task Evaluation` is performed) is governed by the order in which each Draw Unit is created.
it_it: L'ordine di questo elenco (e quindi l'ordine in cui viene eseguita la :ref:`Draw Task Evaluation`) è regolato dall'ordine in cui viene creata ciascuna Draw Unit.

source: The orientation of the display can be changed with :cpp:expr:`lv_display_set_rotation(disp, LV_DISPLAY_ROTATION_xxx)` where ``xxx`` is 0, 90, 180 or 270.
it_it: L'orientamento del display può essere modificato con :cpp:expr:`lv_display_set_rotation(disp, LV_DISPLAY_ROTATION_xxx)` dove ``xxx`` è 0, 90, 180 o 270.

source: The original binary data is directly decoded to RAM.
it_it: I dati binari originali vengono decodificati direttamente nella RAM.

source: The other callbacks are quite similar.
it_it: Le altre callback sono piuttosto simili.

source: The outline (if any) is drawn **outside** the bounding box.
it_it: Il contorno (se presente) viene disegnato **all'esterno** del riquadro di delimitazione.

source: The outline is similar to the border but is drawn outside the object's draw area.
it_it: Il contorno è simile al bordo, ma viene disegnato all'esterno dell'area di disegno dell'oggetto.

source: The outline is used only in :cpp:type:`lv_draw_rect_dsc_t` for convenience.
it_it: Il contorno viene utilizzato solo in :cpp:type:`lv_draw_rect_dsc_t` per comodità.

source: The output engine essentially truncates any output pixels after the desired number of pixels has been written.
it_it: Il motore di output essenzialmente tronca tutti i pixel di output dopo che è stato scritto il numero desiderato di pixel.

source: The output should contain these information:
it_it: L'output dovrebbe contenere queste informazioni:

source: The output trace logs are formatted according to Android's `systrace <https://developer.android.com/topic/performance/tracing>`_ format and can be visualized using `Perfetto <https://ui.perfetto.dev>`_.
it_it: I log di trace in output sono formattati secondo il formato `systrace <https://developer.android.com/topic/performance/tracing>`_ di Android e possono essere visualizzati con `Perfetto <https://ui.perfetto.dev>`_.

source: The overall width of the Table Widget will be set to the sum of all column widths.
it_it: La larghezza complessiva del Widget Table sarà impostata sulla somma delle larghezze di tutte le colonne.

source: The parameter must match one of the language names provided during registration.
it_it: Il parametro deve corrispondere a uno dei nomi di lingua forniti durante la registrazione.

source: The parameter of :cpp:func:`lv_refr_now` is a pointer to the display to refresh.
it_it: Il parametro di :cpp:func:`lv_refr_now` è un puntatore al display da aggiornare.

source: The parameters of the transitions are stored in the styles.
it_it: I parametri delle transizioni sono memorizzati negli stili.

source: The parameters will be passed to the font creation function of the font backend, such as :cpp:func:`lv_freetype_font_create` and :cpp:func:`lv_tiny_ttf_create_file`.
it_it: I parametri verranno passati alla funzione di creazione font del backend font, come :cpp:func:`lv_freetype_font_create` e :cpp:func:`lv_tiny_ttf_create_file`.

source: The parent Widget must be a Flex container for these styles to take effect.
it_it: Affinché questi stili abbiano effetto, il Widget genitore deve essere un contenitore Flex.

source: The parent theme's styles will be added before the custom theme's styles.
it_it: Gli stili del tema genitore verranno aggiunti prima degli stili del tema personalizzato.

source: The parents will use their own state to determine the value.
it_it: I genitori utilizzeranno il proprio stato per determinare il valore.

source: The part of the cache that coincides with the written content will be updated to reflect the written content.
it_it: La parte della cache che coincide con il contenuto scritto verrà aggiornata per riflettere il contenuto scritto.

source: The part should have < 100% opacity to make it visible.
it_it: La parte deve avere un'opacità < 100% per essere visibile.

source: The parts and styles work the same as for :ref:`base_widget`.
it_it: Le parti e gli stili funzionano come per :ref:`base_widget`.

source: The parts of the name are separated by `-`.
it_it: Le parti del nome sono separate da `-`.

source: The path of the image files will be appended to the path set here.
it_it: Il path dei file delle immagini verrà aggiunto al path impostato qui.

source: The path where it was extracted will be needed later.
it_it: Il path in cui è stato estratto sarà necessario in seguito.

source: The pathname of the work directory in which the OpenEmbedded build system builds a recipe.
it_it: Il percorso della directory di lavoro in cui il sistema di build di OpenEmbedded crea una ricetta.

source: The performance will be drastically improved in most cases.
it_it: Nella maggior parte dei casi, le prestazioni saranno notevolmente migliorate.

source: The pivot point for transformations (scaling and rotation).
it_it: Il punto di rotazione per le trasformazioni (ridimensionamento e rotazione).

source: The pixel engine has no additional alignment requirement for linear buffer layouts (:c:macro:`VG_LITE_LINEAR`).
it_it: Il pixel engine non ha requisiti di allineamento aggiuntivi per i layout di buffer lineari (:c:macro:`VG_LITE_LINEAR`).

source: The plugin adds an LVGL Editor button to the toolbar, which launches the LVGL Editor as a separate application, outside of e2 Studio:
it_it: Il plugin aggiunge un pulsante per l'Editor LVGL alla toolbar, che avvia l'Editor LVGL come applicazione separata, al di fuori di e2 Studio:

source: The plugin also shows the "Figma node ID" of the selected element, which allows style synchronization.
it_it: Il plugin mostra anche lo "ID nodo Figma" dell'elemento selezionato, consentendo la sincronizzazione degli stili.

source: The plugin provides the following commands.
it_it: Il plugin fornisce i seguenti comandi.

source: The pointed instance must exist while Widget is alive.
it_it: L'istanza puntata deve esistere mentre il Widget è attivo.

source: The position and size set by the layout overwrites the "normal" x, y, and in some cases the width, and height settings.
it_it: La posizione e le dimensioni impostate dal layout sovrascrivono le impostazioni "normali" di x, y e, in alcuni casi, di larghezza e altezza.

source: The position of the stops are called fractions or offsets and are 8 bit values where 0 is 0% and 255 is 100% of the whole gradient area.
it_it: La posizione degli stop è chiamata frazione o offset e corrisponde a valori a 8 bit, dove 0 corrisponde allo 0% e 255 al 100% dell'intera area del gradiente.

source: The possible "json_type" values are:
it_it: I possibili valori di "json_type" sono:

source: The possible base directions are:
it_it: Le possibili direzioni di base sono:

source: The possible states are:
it_it: I possibili stati sono:

source: The possible values are:
it_it: I valori possibili sono:

source: The possible values for ``flex_flow`` are:
it_it: I possibili valori per ``flex_flow`` sono:

source: The possible values of ``dir`` are the enumeration values of :cpp:type:`lv_dir_t`: ``LV_DIR_NONE/RIGHT/UP/LEFT/DOWN/HOR/VER/ALL`` or their bit-wise OR-ed values to tell the chart which direction(s) to draw its lines.
it_it: I possibili valori di ``dir`` sono i valori di enumerazione di :cpp:type:`lv_dir_t`: ``LV_DIR_NONE/RIGHT/UP/LEFT/DOWN/HOR/VER/ALL`` o i loro valori in OR bit a bit per indicare al grafico in quale direzione tracciare le linee.

source: The precedence (value) of states is quite intuitive, and it's something the user would expect naturally.
it_it: La precedenza (valore) degli stati è piuttosto intuitiva ed è qualcosa che l'utente si aspetterebbe naturalmente.

source: The precompiler is written in Rust, runs on Windows and Linux, and is completely open source.
it_it: Il precompilatore è scritto in Rust, funziona su Windows e Linux ed è completamente open source.

source: The prerequisites listed in ``scripts/install-prerequisites.sh/bat``
it_it: I prerequisiti sono elencati in ``scripts/install-prerequisites.sh/bat``

source: The pressed state has 0x0020 precedence which is higher than the default state's 0x0000 precedence, so gray color will be used.
it_it: Lo stato "pressed" ha una precedenza 0x0020, che è superiore alla precedenza 0x0000 dello stato di default, quindi verrà utilizzato il colore grigio.

source: The process can take a few minutes the first time, depending on your internet speed, but it only happens once.
it_it: Il processo può richiedere alcuni minuti la prima volta, a seconda della velocità della connessione Internet, ma avviene una sola volta.

source: The process is described in details below, using ``SPIFFS`` as demonstration.
it_it: Il processo è descritto in dettaglio di seguito, utilizzando ``SPIFFS`` come dimostrazione.

source: The process outlined here can be adapted for use with other boards.
it_it: Il processo descritto qui può essere adattato per l'utilizzo con altre schede.

source: The processing cost is paid once during environment creation.
it_it: Il costo di elaborazione viene pagato una volta durante la creazione dell'ambiente.

source: The project for `Eclipse CDT <https://projects.eclipse.org/projects/tools.cdt>`__ also uses `SDL <https://www.libsdl.org/>`__.
it_it: Il progetto per `Eclipse CDT <https://projects.eclipse.org/projects/tools.cdt>`__ utilizza anche `SDL <https://www.libsdl.org/>`__.

source: The project provides a flexible set of tools and a space where embedded developers worldwide can share technologies, software stacks, configurations, and best practices that can be used to create tailored Linux images for embedded and IOT devices, or anywhere a customized Linux OS is needed.
it_it: Il progetto fornisce un set flessibile di strumenti e uno spazio in cui gli sviluppatori embedded di tutto il mondo possono condividere tecnologie, stack software, configurazioni e best practice, utilizzabili per creare immagini Linux personalizzate per dispositivi embedded e IoT, o ovunque sia necessario un sistema operativo Linux personalizzato.

source: The project team is obligated to maintain confidentiality with regard to the reporter of an incident.
it_it: Il team di progetto è tenuto a mantenere la riservatezza nei confronti di chi segnala un incidente.

source: The project uses :ref:`build_cmake` to compile LVGL and serves as a CMake example.
it_it: Il progetto utilizza :ref:`build_cmake` per compilare LVGL e funge da esempio di CMake.

source: The project uses :ref:`build_cmake` to compile LVGL, so it also serves as a CMake example.
it_it: Il progetto utilizza :ref:`build_cmake` per compilare LVGL, quindi può essere utilizzato anche come esempio per CMake.

source: The project uses CMake to compile LVGL, so it also serves as a :ref:`build_cmake` example.
it_it: Il progetto utilizza CMake per compilare LVGL, quindi può essere utilizzato anche come esempio di :ref:`build_cmake`.

source: The projects it generates are STM32 HAL based.
it_it: I progetti che genera sono basati su STM32 HAL.

source: The propagation on scrolling is called "scroll chaining" and it can be enabled/disabled with ``LV_OBJ_FLAG_SCROLL_CHAIN_HOR/VER`` flag.
it_it: La propagazione durante lo scorrimento è chiamata "scroll chaining" e può essere abilitata/disabilitata con il flag ``LV_OBJ_FLAG_SCROLL_CHAIN_HOR/VER``.

source: The proper line(s) must be copied to ``main/CMakeLists.txt``
it_it: Le righe corrette devono essere copiate in ``main/CMakeLists.txt``

source: The properties of child elements can be adjusted, such as:
it_it: Le proprietà degli elementi figlio possono essere modificate, ad esempio:

source: The prototype of ``open_cb`` looks like this:
it_it: Il prototipo di ``open_cb`` si presenta così:

source: The provided text buffer must remain available for the lifetime of the Checkbox.
it_it: Il buffer di testo fornito deve rimanere disponibile per tutta la durata della Checkbox.

source: The pseudo device binding descriptions can be found at:
it_it: Le descrizioni dei binding degli pseudo dispositivi sono disponibili all'indirizzo:

source: The purpose is to provide the reader with links to applicable API pages.
it_it: Lo scopo è fornire al lettore i link alle pagine API applicabili.

source: The purpose of this license is to ensure that the Specification remains freely usable for application developers working with LVGL, while restricting its use in third-party UI editors or design tools.
it_it: Lo scopo di questa licenza è garantire che la Specifica rimanga liberamente utilizzabile dagli sviluppatori di applicazioni che lavorano con LVGL, limitandone al contempo l'utilizzo in editor di interfaccia utente o strumenti di progettazione di terze parti.

source: The quality of the transformation can be adjusted with :cpp:expr:`lv_image_set_antialias(img, true)`.
it_it: La qualità della trasformazione può essere regolata con :cpp:expr:`lv_image_set_antialias(img, true)`.

source: The radial gradient is described by two circles: an outer circle and an inner circle (also called the focal point).
it_it: Il gradiente radiale è descritto da due cerchi: un cerchio esterno e un cerchio interno (chiamato anche punto focale).

source: The radius of the blur.
it_it: Il raggio della sfocatura.

source: The radius of the corners.
it_it: Il raggio degli angoli.

source: The ramifications of having multiple drawing threads are taken into account for this.
it_it: A questo scopo, vengono prese in considerazione le implicazioni derivanti dalla presenza di più thread di disegno.

source: The range is provided as the first and last unicode code points in the range.
it_it: L'intervallo è fornito come primo e ultimo punto di codice Unicode nell'intervallo.

source: The range of the integer and float subjects can be limited by setting minimum and maximum values:
it_it: Il "range" [intervallo] degli oggetti interi e float può essere limitato impostando valori minimi e massimi:

source: The real type of :cpp:type:`lv_3dtexture_id_t` depends on the active 3D graphics back-end.
it_it: Il tipo effettivo di :cpp:type:`lv_3dtexture_id_t` dipende dal back-end grafico 3D attivo.

source: The reason this is okay is that the LVGL data changed by them is itself atomic.
it_it: Il motivo per cui ciò è accettabile è che i dati LVGL da loro modificati sono essi stessi atomici.

source: The recognizers can be updated to recognize gestures by calling :cpp:expr:`lv_indev_gesture_recognizers_update(indev, touches, touch_cnt)`.
it_it: I riconoscitori possono essere aggiornati per riconoscere i gesti chiamando :cpp:expr:`lv_indev_gesture_recognizers_update(indev, touches, touch_cnt)`.

source: The recommended way for consuming CMakePresets is a CMakePresets aware IDE such as
it_it: Il metodo consigliato per utilizzare CMakePresets è un IDE compatibile con CMakePresets come

source: The recommended way to add LVGL and display drivers is through the PlatformIO Home GUI in VS Code:
it_it: Il metodo consigliato per aggiungere driver LVGL e display è tramite l'interfaccia utente di PlatformIO Home in VS Code:

source: The recommended way to integrate the required libraries is using CMake's FetchContent:
it_it: Il metodo consigliato per integrare le librerie richieste è utilizzare FetchContent di CMake:

source: The reference DPI is 160, on which ``lv_dpx(100)`` returns ``100``.
it_it: Il DPI di riferimento è 160, su cui ``lv_dpx(100)`` restituisce ``100``.

source: The reference PNG images should have a **32-bit color format** and match the display size.
it_it: Le immagini PNG di riferimento devono avere un **formato colore a 32 bit** e corrispondere alle dimensioni del display.

source: The refreshing will happen in :cpp:func:`lv_refr_now` which might take longer.
it_it: L'aggiornamento avverrà in :cpp:func:`lv_refr_now`, il che potrebbe richiedere più tempo.

source: The registry can be installed and started with a single command:
it_it: Il registry può essere installato e avviato con un singolo comando:

source: The registry container will listen on port ``TCP/5000`` and will map to the same port externally.
it_it: Il "registry container" ascolterà sulla porta ``TCP/5000`` e verrà mappato esternamente alla stessa porta.

source: The remaining steps can **optionally** be done inside a Docker container.
it_it: I passaggi rimanenti possono essere eseguiti **facoltativamente** all'interno di un container Docker.

source: The remap callback is invoked only for keypad input devices.
it_it: La callback di rimappatura viene invocata solo per i dispositivi di input tramite tastiera.

source: The renderer uses OpenGL ES 3.0 shaders (GLSL version 300 es) to provide modern PBR (Physically Based Rendering) capabilities.
it_it: Il renderer utilizza shader OpenGL ES 3.0 (GLSL versione 300 es) per fornire moderne funzionalità PBR (Physically Based Rendering).

source: The rendering backend will obtain the GPU's working status every time it writes rendering instructions to the command buffer.
it_it: Il backend di rendering otterrà lo stato di funzionamento della GPU ogni volta che scrive istruzioni di rendering nel buffer di comando.

source: The resolution and color format can be changed at any time by calling :cpp:func:`lv_display_set_resolution` and :cpp:func:`lv_display_set_color_format`.
it_it: La risoluzione e il formato del colore possono essere modificati in qualsiasi momento chiamando :cpp:func:`lv_display_set_resolution` e :cpp:func:`lv_display_set_color_format`.

source: The resolution of the screen always matches the resolution of the display.
it_it: La risoluzione dello schermo corrisponde sempre alla risoluzione del display.

source: The rest of the options can remain default.
it_it: Le restanti opzioni possono rimanere quelle di default.

source: The resulting code is completely self-sufficient and the XML files are not needed anymore.
it_it: Il codice risultante è completamente autosufficiente e i file XML non sono più necessari.

source: The resulting code is similar to what one could write by hand as well.
it_it: Il codice risultante è simile a quello che si potrebbe scrivere anche a mano.

source: The resulting files can then be integrated into the project, it's better to re-run ``wayland-scanner`` on each build to ensure that the correct versions are generated, they must match the version of the ``wayland-client`` dynamically linked library installed on the system.
it_it: I file risultanti possono quindi essere integrati nel progetto. È consigliabile eseguire nuovamente ``wayland-scanner`` su ogni build per garantire che vengano generate le versioni corrette, che devono corrispondere alla versione della libreria ``wayland-client`` linkata dinamicamente installata sul sistema.
